In [ ]:
import pandas as pd 
from datetime import datetime

# pd.date_range(datetime.today(), periods=10).to_pydatetime().tolist()
# d=pd.date_range(start='2020-01-01', end='2020-01-10')

d = ['20200101','20200101','20200101','20200102','20200102',
'20200102','20200103','20200103','20200103']
col1 = ['a','b','c','a','b','c','a','d','e']
col2 = [1,2,3,1,2,3,1,2,3]
data = {'date':d, 'col1':col1, 'col2':col2}
df = pd.DataFrame(data)
df.pivot_table(index='date', columns='col1', values='col2')

In [1]:
import numpy as np
import pandas as pd

df = pd.read_excel('../data/02. sales-funnel.xlsx')
df.head()
df.shape
df.index
pd.pivot_table(df, index=['Account'], columns=['Name'], values=['Price'])

             Price                                                        \
Name    Barton LLC Fritsch, Russel and Anderson Herman LLC Jerde-Hilpert
Account
141962         NaN                          NaN    65000.0           NaN
146832         NaN                          NaN        NaN           NaN
163416         NaN                          NaN        NaN           NaN
218895         NaN                          NaN        NaN           NaN
239344         NaN                          NaN        NaN           NaN
307599         NaN                          NaN        NaN           NaN
412290         NaN                          NaN        NaN        5000.0
688981         NaN                          NaN        NaN           NaN
714466         NaN                          NaN        NaN           NaN
729833         NaN                          NaN        NaN           NaN
737550         NaN                      35000.0        NaN           NaN
740150     35000.0                          NaN        NaN           NaN

                                                                        \
Name    Kassulke, Ondricka and Metz Keeling LLC Kiehn-Spinka Koepp Ltd
Account
141962                          NaN         NaN          NaN       NaN
146832                          NaN         NaN      65000.0       NaN
163416                          NaN         NaN          NaN       NaN
218895                          NaN         NaN          NaN       NaN
239344                          NaN         NaN          NaN       NaN
307599                       7000.0         NaN          NaN       NaN
412290                          NaN         NaN          NaN       NaN
688981                          NaN    100000.0          NaN       NaN
714466                          NaN         NaN          NaN       NaN
729833                          NaN         NaN          NaN   35000.0
737550                          NaN         NaN          NaN       NaN
740150                          NaN         NaN          NaN       NaN


Name    Kulas Inc Purdy-Kunde Stokes LLC Trantow-Barrows
Account
141962        NaN         NaN        NaN             NaN
146832        NaN         NaN        NaN             NaN
163416        NaN     30000.0        NaN             NaN
218895    25000.0         NaN        NaN             NaN
239344        NaN         NaN     7500.0             NaN
307599        NaN         NaN        NaN             NaN
412290        NaN         NaN        NaN             NaN
688981        NaN         NaN        NaN             NaN
714466        NaN         NaN        NaN         15000.0
729833        NaN         NaN        NaN             NaN
737550        NaN         NaN        NaN             NaN
740150        NaN         NaN        NaN             NaN

In [2]:
col1 = ['abb','def','dda','abb','abb']
col2 = ['x1','x2','y1','y2','x2']
col3 = [2,2,2,2,2]

data = {'col1':col1, 'col2':col2, 'col3':col3}
df = pd.DataFrame(data)
pd.pivot(df, index='col1', columns='col2', values='col3').fillna(0)

col2   x1   x2   y1   y2
col1
abb   2.0  2.0  0.0  2.0
dda   0.0  0.0  2.0  0.0
def   0.0  2.0  0.0  0.0

In [14]:
df2=pd.DataFrame(
    {'foo':['one','one','one','two','two','two','two','one'],
    'bar':['A','B','C','A','B','C','D','D'],
    'bar2':[1,2,3,4,5,6,7,8],
    'zoo':['x','y','z','q','w','t','s','r']
    })
df2.pivot(index='foo', columns='bar', values='bar2')
# df2.set_index(['foo','bar'])[['bar2']].unstack()
df2.pivot(index='foo', columns='bar')['bar2']
df2.pivot(index='foo', columns='bar', values=['bar2','zoo'])

    bar2          zoo
bar    A  B  C  D   A  B  C  D
foo
one    1  2  3  8   x  y  z  r
two    4  5  6  7   q  w  t  s

In [22]:
df3=pd.DataFrame(
    {'foo':['one','one','two','two'],
    'bar':['A','A','B','C'],
    'baz':[1,2,3,4],
    })
# df3.pivot(index='foo', columns='bar', values='baz') #Index contains duplicate entries, cannot reshape
df3.pivot_table(index='foo', columns='bar', values='baz', aggfunc=np.mean)

bar    A    B    C
foo
one  1.5  NaN  NaN
two  NaN  3.0  4.0

In [31]:
df3 = pd.DataFrame({
    'col1':[100,87,92,10,20],
    'col2':[30,29,30,30,100],
    'col3':[89,20,3,2,20]
})

from sklearn import preprocessing
cols = ['col1','col2','col3']
df4 = df3[cols].values
min_max_scaler = preprocessing.MinMaxScaler()
x_data = min_max_scaler.fit_transform(df4.astype(float))
x_data.shape
df5 = pd.DataFrame(x_data)
df5

          0         1         2
0  1.000000  0.014085  1.000000
1  0.855556  0.000000  0.206897
2  0.911111  0.014085  0.011494
3  0.000000  0.014085  0.000000
4  0.111111  1.000000  0.206897